In [1]:
# This is to avoid error when running Hands-on Lab on third-party tool.
# Unable to connect:  [IBM][CLI Driver] SQL10013N  The specified library "GSKit Error: 207" could not be loaded.  SQLSTATE=42724 SQLCODE=-10013
# source: https://github.com/ibmdb/python-ibmdb/issues/650

# !pip install sqlalchemy==1.3.9
# !pip install ibm_db_sa
# !pip install ipython-sql

In [2]:
%load_ext sql

# Enter the connection string for your Db2 on Cloud database instance below
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name?security=SSL
%sql ibm_db_sa://sbq39922:<PASSWORD>@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb?security=SSL

In [3]:
# retrieve list of all tables in the database for your db2 schema (username)

%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES \
     where TABSCHEMA not in ('SYSIBM', 'SYSCAT', 'SYSSTAT', 'SYSIBMADM', 'SYSTOOLS', 'SYSPUBLIC')

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('SBQ39922', 'PETSALE', datetime.datetime(2021, 9, 30, 16, 57, 32, 974730)),
 ('SBQ39922', 'EMPLOYEES', datetime.datetime(2021, 9, 30, 17, 16, 34, 506400)),
 ('SBQ39922', 'JOB_HISTORY', datetime.datetime(2021, 9, 30, 17, 16, 34, 616621)),
 ('SBQ39922', 'JOBS', datetime.datetime(2021, 9, 30, 17, 16, 34, 742614)),
 ('SBQ39922', 'DEPARTMENTS', datetime.datetime(2021, 9, 30, 17, 16, 34, 867631)),
 ('SBQ39922', 'LOCATIONS', datetime.datetime(2021, 9, 30, 17, 16, 34, 992048)),
 ('SBQ39922', 'PETRESCUE', datetime.datetime(2021, 10, 8, 14, 30, 16, 492096)),
 ('SBQ39922', 'INSTRUCTOR', datetime.datetime(2021, 10, 8, 20, 53, 19, 796647)),
 ('SBQ39922', 'INTERNATIONAL_STUDENT_TEST_SCORES', datetime.datetime(2021, 10, 8, 21, 20, 34, 296727)),
 ('SBQ39922', 'CHICAGO_SOCIOECONOMIC_DATA', datetime.datetime(2021, 10, 9, 8, 47, 35, 352945)),
 ('SBQ39922', 'SCHOOLS', datetime.datetime(2021, 10, 9, 9, 45, 18, 249512)),
 ('SBQ39922', 'CHICAGO_PUBLIC_SCHOOLS', datetime.datetime(2021, 10, 9, 11, 29, 29, 655613)),
 ('SBQ39922', 'CENSUS_DATA', datetime.datetime(2021, 10, 9, 11, 30, 44, 87836)),
 ('SBQ39922', 'CHICAGO_CRIME_DATA', datetime.datetime(2021, 10, 9, 11, 31, 59, 404494)),
 ('SBQ39922', 'EMPS', datetime.datetime(2021, 10, 11, 10, 32, 25, 792881)),
 ('SBQ39922', 'SHOESHOP', datetime.datetime(2021, 10, 11, 11, 19, 27, 301258)),
 ('SBQ39922', 'BANKACCOUNTS', datetime.datetime(2021, 10, 11, 11, 19, 34, 80804))]

In [4]:
%sql select * from employees

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '123410   ', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500      ', Decimal('70000.00'), '30001    ', '2        '),
 ('E1006    ', 'Nancy', 'Allen', '123411   ', datetime.date(1978, 2, 6), 'F', '111 Green Pl, Elgin,IL', '600      ', Decimal('90000.00'), '30001    ', '2        '),
 ('E1007    ', 'Mary', 'Thomas', '123412   ', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1008    ', 'Bharath', 'Gupta', '123413   ', datetime.date(1985, 5, 6), 'M', '145 Berry Ln, Naperville,IL', '660      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1009    ', 'Andrea', 'Jones', '123414   ', datetime.date(1990, 7, 9), 'F', '120 Fall Creek, Gary,IL', '234      ', Decimal('70000.00'), '30003    ', '7        '),
 ('E1010    ', 'Ann', 'Jacob', '123415   ', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220      ', Decimal('70000.00'), '30004    ', '5        ')]

In [5]:
%sql select * from job_history

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('E1001    ', datetime.date(2000, 8, 1), '100      ', '2        '),
 ('E1002    ', datetime.date(2001, 8, 1), '200      ', '5        '),
 ('E1003    ', datetime.date(2001, 8, 16), '300      ', '5        '),
 ('E1004    ', datetime.date(2000, 8, 16), '400      ', '5        '),
 ('E1005    ', datetime.date(2000, 5, 30), '500      ', '2        '),
 ('E1006    ', datetime.date(2001, 8, 16), '600      ', '2        '),
 ('E1007    ', datetime.date(2002, 5, 30), '650      ', '7        '),
 ('E1008    ', datetime.date(2010, 5, 6), '660      ', '7        '),
 ('E1009    ', datetime.date(2016, 8, 16), '234      ', '7        '),
 ('E1010    ', datetime.date(2016, 8, 16), '220      ', '5        ')]

In [6]:
%sql select * from jobs

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('100      ', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('200      ', 'Sr.Software Dev', Decimal('60000.00'), Decimal('80000.00')),
 ('220      ', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('234      ', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('300      ', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('400      ', 'Jr.Software Dev', Decimal('40000.00'), Decimal('60000.00')),
 ('500      ', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('600      ', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('650      ', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('660      ', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00'))]

In [7]:
%sql select * from departments

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('5        ', 'Software Group', '30002    ', 'L0002    '),
 ('7        ', 'Design Team', '30003    ', 'L0003    ')]

In [8]:
%sql select * from locations

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('L0001    ', '2        '),
 ('L0002    ', '5        '),
 ('L0003    ', '7        ')]

### Problem 1: Select the names and job start dates of all employees who work for the department number 5.

In [22]:
%%sql
select e.f_name, e.l_name, j.start_date, j.dept_id
from employees e inner join job_history j on e.emp_id = j.empl_id
where e.dep_id = '5'

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('Alice', 'James', datetime.date(2001, 8, 1), '5        '),
 ('Steve', 'Wells', datetime.date(2001, 8, 16), '5        '),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16), '5        '),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16), '5        ')]

### Problem 2: Select the names, job start dates, and job titles of all employees who work for the department number 5.

In [21]:
%%sql
select e.f_name, e.l_name, jh.start_date, jo.job_title
from employees e 
inner join job_history jh on e.emp_id = jh.empl_id
inner join jobs jo on e.job_id = jo.job_ident
where e.dep_id = '5'

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('Alice', 'James', datetime.date(2001, 8, 1), 'Sr.Software Dev'),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16), 'Sr. Designer'),
 ('Steve', 'Wells', datetime.date(2001, 8, 16), 'Jr.Software Dev'),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16), 'Jr.Software Dev')]

### Problem 3: Perform a Left Outer Join on the EMPLOYEES and DEPARTMENT tables and select employee id, last name, department id and department name for all employees.

In [26]:
%%sql
select e.emp_id, e.l_name, d.dept_id_dep, d.dep_name
from employees e 
left outer join departments d on e.dep_id = d.dept_id_dep

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1005    ', 'Hussain', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1010    ', 'Jacob', '5        ', 'Software Group'),
 ('E1004    ', 'Kumar', '5        ', 'Software Group'),
 ('E1003    ', 'Wells', '5        ', 'Software Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team'),
 ('E1009    ', 'Jones', '7        ', 'Design Team'),
 ('E1008    ', 'Gupta', '7        ', 'Design Team')]

### Problem 4: Re-write the previous query but limit the result set to include only the rows for employees born before 1980.

In [33]:
%%sql
select e.emp_id, e.l_name, e.b_date, d.dept_id_dep, d.dep_name
from employees e 
left outer join departments d on e.dep_id = d.dept_id_dep
where year(e.b_date) < 1980

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('E1001    ', 'Thomas', datetime.date(1976, 1, 9), '2        ', 'Architect Group'),
 ('E1006    ', 'Allen', datetime.date(1978, 2, 6), '2        ', 'Architect Group'),
 ('E1002    ', 'James', datetime.date(1972, 7, 31), '5        ', 'Software Group'),
 ('E1007    ', 'Thomas', datetime.date(1975, 5, 5), '7        ', 'Design Team')]

### Problem 5: Re-write the previous query but have the result set include all the employees but department names for only the employees who were born before 1980.

In [44]:
%%sql
select e.emp_id, e.l_name, e.b_date, d.dept_id_dep, d.dep_name
from employees e 
left outer join departments d on e.dep_id = d.dept_id_dep and year(e.b_date) < 1980

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('E1001    ', 'Thomas', datetime.date(1976, 1, 9), '2        ', 'Architect Group'),
 ('E1002    ', 'James', datetime.date(1972, 7, 31), '5        ', 'Software Group'),
 ('E1003    ', 'Wells', datetime.date(1980, 8, 10), None, None),
 ('E1004    ', 'Kumar', datetime.date(1985, 7, 20), None, None),
 ('E1005    ', 'Hussain', datetime.date(1981, 1, 4), None, None),
 ('E1006    ', 'Allen', datetime.date(1978, 2, 6), '2        ', 'Architect Group'),
 ('E1007    ', 'Thomas', datetime.date(1975, 5, 5), '7        ', 'Design Team'),
 ('E1008    ', 'Gupta', datetime.date(1985, 5, 6), None, None),
 ('E1009    ', 'Jones', datetime.date(1990, 7, 9), None, None),
 ('E1010    ', 'Jacob', datetime.date(1982, 3, 30), None, None)]

### Problem 6: Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

In [42]:
%%sql
select e.f_name, e.l_name, d.dep_name
from employees e
full outer join departments d on e.dep_id = d.dept_id_dep

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('John', 'Thomas', 'Architect Group'),
 ('Alice', 'James', 'Software Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Ann', 'Jacob', 'Software Group')]

In [41]:
# %%sql
# select e.f_name, e.l_name, d.dep_name
# from employees e
# left outer join departments d on e.dep_id = d.dept_id_dep

### Problem 7: Re-write the previous query but have the result set include all employee names but department id and department names only for male employees.

In [45]:
%%sql
select e.f_name, e.l_name, d.dep_name, d.dept_id_dep
from employees e
full outer join departments d on e.dep_id = d.dept_id_dep and e.sex = 'M'

 * ibm_db_sa://sbq39922:***@764264db-9824-4b7c-82df-40d1b13897c2.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:32536/bludb
Done.

[('John', 'Thomas', 'Architect Group', '2        '),
 ('Alice', 'James', None, None),
 ('Steve', 'Wells', 'Software Group', '5        '),
 ('Santosh', 'Kumar', 'Software Group', '5        '),
 ('Ahmed', 'Hussain', 'Architect Group', '2        '),
 ('Nancy', 'Allen', None, None),
 ('Mary', 'Thomas', None, None),
 ('Bharath', 'Gupta', 'Design Team', '7        '),
 ('Andrea', 'Jones', None, None),
 ('Ann', 'Jacob', None, None)]